In [3]:
%matplotlib inline
# See all the "as ..." contructs? They're just aliasing the package names.
# That way we can call methods like plt.plot() instead of matplotlib.pyplot.plot().
import numpy as np
import scipy as sp
import matplotlib as mpl
import matplotlib.cm as cm
import matplotlib.pyplot as plt
import pandas as pd
import time
pd.set_option('display.width', 500)
pd.set_option('display.max_columns', 100)
pd.set_option('display.notebook_repr_html', True)
import seaborn as sns
sns.set_style("whitegrid")
sns.set_context("poster")

In [4]:
from sqlite3 import dbapi2 as sq3
import os
PATHSTART="."

def get_db(dbfile):
    sqlite_db = sq3.connect(os.path.join(PATHSTART, dbfile))
    return sqlite_db

In [5]:
def init_db(dbfile, schema):
    db = get_db(dbfile)
    db.cursor().executescript(schema)
    db.commit()
    return db

In [6]:
ourschema="""
DROP TABLE IF EXISTS "candidates";
DROP TABLE IF EXISTS "contributors";
CREATE TABLE "candidates" (
    "id" INTEGER PRIMARY KEY  NOT NULL,
    "first_name" VARCHAR,
    "last_name" VARCHAR,
    "middle_name" VARCHAR,
    "party" VARCHAR NOT NULL
);
CREATE TABLE "contributors" (
    "id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
    "last_name" VARCHAR,
    "first_name" VARCHAR,
    "middle_name" VARCHAR,
    "street_1" VARCHAR,
    "street_2" VARCHAR,
    "city" VARCHAR,
    "state" VARCHAR,
    "zip" VARCHAR,
    "amount" INTEGER,
    "date" DATETIME,
    "candidate_id" INTEGER NOT NULL,
    FOREIGN KEY(candidate_id) REFERENCES candidates(id)
);
"""

In [7]:
dfcand = pd.read_csv("./candidates.txt", sep='|')

In [8]:
dfcand

    id   first_name   last_name middle_name party
0   33       Joseph       Biden         NaN     D
1   36       Samuel   Brownback         NaN     R
2   34      Hillary     Clinton          R.     D
3   39  Christopher        Dodd          J.     D
4   26         John     Edwards         NaN     D
5   22      Rudolph    Giuliani         NaN     R
6   24         Mike      Gravel         NaN     D
7   16         Mike    Huckabee         NaN     R
8   30       Duncan      Hunter         NaN     R
9   31       Dennis    Kucinich         NaN     D
10  37         John      McCain         NaN     R
11  20       Barack       Obama         NaN     D
12  32          Ron        Paul         NaN     R
13  29         Bill  Richardson         NaN     D
14  35         Mitt      Romney         NaN     R
15  38          Tom    Tancredo         NaN     R
16  41         Fred    Thompson          D.     R

In [9]:
dfcwci = pd.read_csv("./contributors_with_candidate_id.txt", sep="|")
dfcwci.head()

   id last_name first_name middle_name                street_1 street_2         city state    zip  amount        date  candidate_id
0 NaN      Agee     Steven         NaN  549 Laurel Branch Road      NaN        Floyd    VA  24091   500.0  2007-06-30            16
1 NaN    Ahrens        Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566   250.0  2007-05-16            16
2 NaN    Ahrens        Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566    50.0  2007-06-18            16
3 NaN    Ahrens        Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566   100.0  2007-06-21            16
4 NaN      Akin    Charles         NaN  10187 Sugar Creek Road      NaN  Bentonville    AR  72712   100.0  2007-06-16            16

In [10]:
dfcwci.dtypes

id              float64
last_name        object
first_name       object
middle_name      object
street_1         object
street_2         object
city             object
state            object
zip               int64
amount          float64
date             object
candidate_id      int64
dtype: object

In [11]:
del dfcwci['id']
dfcwci.head()

  last_name first_name middle_name                street_1 street_2         city state    zip  amount        date  candidate_id
0      Agee     Steven         NaN  549 Laurel Branch Road      NaN        Floyd    VA  24091   500.0  2007-06-30            16
1    Ahrens        Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566   250.0  2007-05-16            16
2    Ahrens        Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566    50.0  2007-06-18            16
3    Ahrens        Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566   100.0  2007-06-21            16
4      Akin    Charles         NaN  10187 Sugar Creek Road      NaN  Bentonville    AR  72712   100.0  2007-06-16            16

In [12]:
type(dfcand)

pandas.core.frame.DataFrame

In [14]:
import os
PATHSTART="."
db= sq3.connect(os.path.join(PATHSTART, "cancont.db"))

In [13]:
dfcand.to_sql("candidates", db, if_exists="append", index=False)

In [14]:
dfcwci.to_sql("contributors", db, if_exists="append", index=False)

In [15]:
dfcwci.shape

(175, 11)

In [16]:
sel="""
SELECT * FROM candidates;
"""

c=db.cursor().execute(sel)

In [17]:
c

In [23]:
c.fetchall()

[(16, 'Mike', 'Huckabee', None, 'R'),
 (20, 'Barack', 'Obama', None, 'D'),
 (22, 'Rudolph', 'Giuliani', None, 'R'),
 (24, 'Mike', 'Gravel', None, 'D'),
 (26, 'John', 'Edwards', None, 'D'),
 (29, 'Bill', 'Richardson', None, 'D'),
 (30, 'Duncan', 'Hunter', None, 'R'),
 (31, 'Dennis', 'Kucinich', None, 'D'),
 (32, 'Ron', 'Paul', None, 'R'),
 (33, 'Joseph', 'Biden', None, 'D'),
 (34, 'Hillary', 'Clinton', 'R.', 'D'),
 (35, 'Mitt', 'Romney', None, 'R'),
 (36, 'Samuel', 'Brownback', None, 'R'),
 (37, 'John', 'McCain', None, 'R'),
 (38, 'Tom', 'Tancredo', None, 'R'),
 (39, 'Christopher', 'Dodd', 'J.', 'D'),
 (41, 'Fred', 'Thompson', 'D.', 'R')]

In [22]:
rem="""
DELETE FROM candidates;
"""
c=db.cursor().execute(rem)
db.commit()

In [23]:
c.fetchall()

[]

In [24]:
ins="""
INSERT INTO candidates (id, first_name, last_name, middle_name, party) \
    VALUES (?,?,?,?,?);
"""

with open("candidates.txt") as fd:
    slines = [l.strip().split('|') for l in fd.readlines()]
    print(slines)
    for line in slines[1:]:
        theid, first_name, last_name, middle_name, party = line
        valstoinsert = (int(theid), first_name, last_name, middle_name, party)
        print(ins, valstoinsert)
        db.cursor().execute(ins, valstoinsert)

[['id', 'first_name', 'last_name', 'middle_name', 'party'], ['33', 'Joseph', 'Biden', '', 'D'], ['36', 'Samuel', 'Brownback', '', 'R'], ['34', 'Hillary', 'Clinton', 'R.', 'D'], ['39', 'Christopher', 'Dodd', 'J.', 'D'], ['26', 'John', 'Edwards', '', 'D'], ['22', 'Rudolph', 'Giuliani', '', 'R'], ['24', 'Mike', 'Gravel', '', 'D'], ['16', 'Mike', 'Huckabee', '', 'R'], ['30', 'Duncan', 'Hunter', '', 'R'], ['31', 'Dennis', 'Kucinich', '', 'D'], ['37', 'John', 'McCain', '', 'R'], ['20', 'Barack', 'Obama', '', 'D'], ['32', 'Ron', 'Paul', '', 'R'], ['29', 'Bill', 'Richardson', '', 'D'], ['35', 'Mitt', 'Romney', '', 'R'], ['38', 'Tom', 'Tancredo', '', 'R'], ['41', 'Fred', 'Thompson', 'D.', 'R']]

INSERT INTO candidates (id, first_name, last_name, middle_name, party)     VALUES (?,?,?,?,?);
 (33, 'Joseph', 'Biden', '', 'D')

INSERT INTO candidates (id, first_name, last_name, middle_name, party)     VALUES (?,?,?,?,?);
 (36, 'Samuel', 'Brownback', '', 'R')

INSERT INTO candidates (id, first_name, last_name, middle_name, party)     VALUES (?,?,?,?,?);
 (34, 'Hillary', 'Clinton', 'R.', 'D')

INSERT INTO candidates (id, first_name, last_name, middle_name, party)     VALUES (?,?,?,?,?);
 (39, 'Christopher', 'Dodd', 'J.', 'D')

INSERT INTO candidates (id, first_name, last_name, middle_name, party)     VALUES (?,?,?,?,?);
 (26, 'John', 'Edwards', '', 'D')

INSERT INTO candidates (id, first_name, last_name, middle_name, party)     VALUES (?,?,?,?,?);
 (22, 'Rudolph', 'Giuliani', '', 'R')

INSERT INTO candidates (id, first_name, last_name, middle_name, party)     VALUES (?,?,?,?,?);
 (24, 'Mike', 'Gravel', '', 'D')

INSERT INTO candidates (id, first_name, last_name, middle_name, party)     VALUES (?,?,?,?,?);
 (16, 'Mike', 'Huckabee', '', 'R')

INSERT INTO candidates (id, first_name, last_name, middle_name, party)     VALUES (?,?,?,?,?);
 (30, 'Duncan', 'Hunter', '', 'R')

INSERT INTO candidates (id, first_name, last_name, middle_name, party)     VALUES (?,?,?,?,?);
 (31, 'Dennis', 'Kucinich', '', 'D')

INSERT INTO candidates (id, first_name, last_name, middle_name, party)     VALUES (?,?,?,?,?);
 (37, 'John', 'McCain', '', 'R')

INSERT INTO candidates (id, first_name, last_name, middle_name, party)     VALUES (?,?,?,?,?);
 (20, 'Barack', 'Obama', '', 'D')

INSERT INTO candidates (id, first_name, last_name, middle_name, party)     VALUES (?,?,?,?,?);
 (32, 'Ron', 'Paul', '', 'R')

INSERT INTO candidates (id, first_name, last_name, middle_name, party)     VALUES (?,?,?,?,?);
 (29, 'Bill', 'Richardson', '', 'D')

INSERT INTO candidates (id, first_name, last_name, middle_name, party)     VALUES (?,?,?,?,?);
 (35, 'Mitt', 'Romney', '', 'R')

INSERT INTO candidates (id, first_name, last_name, middle_name, party)     VALUES (?,?,?,?,?);
 (38, 'Tom', 'Tancredo', '', 'R')

INSERT INTO candidates (id, first_name, last_name, middle_name, party)     VALUES (?,?,?,?,?);
 (41, 'Fred', 'Thompson', 'D.', 'R')

In [25]:
db.commit()

## make_query()

In [14]:
import os
db = sq3.connect(os.path.join(PATHSTART, "cancont.db"))

In [19]:
def make_query(sel):
    c = db.cursor().execute(sel)
    return c.fetchall()

make_query("SELECT * FROM candidates;")

[(16, 'Mike', 'Huckabee', None, 'R'),
 (20, 'Barack', 'Obama', None, 'D'),
 (22, 'Rudolph', 'Giuliani', None, 'R'),
 (24, 'Mike', 'Gravel', None, 'D'),
 (26, 'John', 'Edwards', None, 'D'),
 (29, 'Bill', 'Richardson', None, 'D'),
 (30, 'Duncan', 'Hunter', None, 'R'),
 (31, 'Dennis', 'Kucinich', None, 'D'),
 (32, 'Ron', 'Paul', None, 'R'),
 (33, 'Joseph', 'Biden', None, 'D'),
 (34, 'Hillary', 'Clinton', 'R.', 'D'),
 (35, 'Mitt', 'Romney', None, 'R'),
 (36, 'Samuel', 'Brownback', None, 'R'),
 (37, 'John', 'McCain', None, 'R'),
 (38, 'Tom', 'Tancredo', None, 'R'),
 (39, 'Christopher', 'Dodd', 'J.', 'D'),
 (41, 'Fred', 'Thompson', 'D.', 'R')]

In [6]:
type(make_query("SELECT * FROM candidates;"))

list

In [7]:
rem="""
DELETE FROM candidates;
"""

c = db.cursor().execute(rem)
db.commit()

In [35]:
make_query("SELECT * FROM candidates")

[]

In [36]:
%%bash
tail -n +2 candidates.txt > candidates_nohead.txt
echo ".import candidates_nohead.txt candidates" | sqlite3 cancont.db

In [24]:
make_query("SELECT * FROM candidates")

[(16, 'Mike', 'Huckabee', None, 'R'),
 (20, 'Barack', 'Obama', None, 'D'),
 (22, 'Rudolph', 'Giuliani', None, 'R'),
 (24, 'Mike', 'Gravel', None, 'D'),
 (26, 'John', 'Edwards', None, 'D'),
 (29, 'Bill', 'Richardson', None, 'D'),
 (30, 'Duncan', 'Hunter', None, 'R'),
 (31, 'Dennis', 'Kucinich', None, 'D'),
 (32, 'Ron', 'Paul', None, 'R'),
 (33, 'Joseph', 'Biden', None, 'D'),
 (34, 'Hillary', 'Clinton', 'R.', 'D'),
 (35, 'Mitt', 'Romney', None, 'R'),
 (36, 'Samuel', 'Brownback', None, 'R'),
 (37, 'John', 'McCain', None, 'R'),
 (38, 'Tom', 'Tancredo', None, 'R'),
 (39, 'Christopher', 'Dodd', 'J.', 'D'),
 (41, 'Fred', 'Thompson', 'D.', 'R')]

In [38]:
dfcwci.head()

  last_name first_name middle_name                street_1 street_2         city state    zip  amount        date  candidate_id
0      Agee     Steven         NaN  549 Laurel Branch Road      NaN        Floyd    VA  24091   500.0  2007-06-30            16
1    Ahrens        Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566   250.0  2007-05-16            16
2    Ahrens        Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566    50.0  2007-06-18            16
3    Ahrens        Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566   100.0  2007-06-21            16
4      Akin    Charles         NaN  10187 Sugar Creek Road      NaN  Bentonville    AR  72712   100.0  2007-06-16            16

In [39]:
dfcwci.query("state=='VA' & amount < 400")

     last_name first_name middle_name                     street_1 street_2             city state        zip  amount        date  candidate_id
27    Buckheit      Bruce         NaN                8904 KAREN DR      NaN          FAIRFAX    VA  220312731  100.00  2007-09-19            20
77   Ranganath      Anoop         NaN           2507 Willard Drive      NaN  Charlottesville    VA      22903 -100.00  2008-04-21            32
88   Perreault     Louise         NaN    503 Brockridge Hunt Drive      NaN          Hampton    VA      23666  -34.08  2008-04-21            32
145    ABDELLA     THOMAS          M.  4231 MONUMENT WALL WAY #340      NaN          FAIRFAX    VA  220308440   50.00  2007-09-30            35

In [40]:
dfcwci[(dfcwci.state == 'VA') & (dfcwci.amount < 400)]

     last_name first_name middle_name                     street_1 street_2             city state        zip  amount        date  candidate_id
27    Buckheit      Bruce         NaN                8904 KAREN DR      NaN          FAIRFAX    VA  220312731  100.00  2007-09-19            20
77   Ranganath      Anoop         NaN           2507 Willard Drive      NaN  Charlottesville    VA      22903 -100.00  2008-04-21            32
88   Perreault     Louise         NaN    503 Brockridge Hunt Drive      NaN          Hampton    VA      23666  -34.08  2008-04-21            32
145    ABDELLA     THOMAS          M.  4231 MONUMENT WALL WAY #340      NaN          FAIRFAX    VA  220308440   50.00  2007-09-30            35

## def make_frame()

In [16]:
make_query("PRAGMA table_info(contributors);")

[(0, 'id', 'INTEGER', 1, None, 1),
 (1, 'last_name', 'VARCHAR', 0, None, 0),
 (2, 'first_name', 'VARCHAR', 0, None, 0),
 (3, 'middle_name', 'VARCHAR', 0, None, 0),
 (4, 'street_1', 'VARCHAR', 0, None, 0),
 (5, 'street_2', 'VARCHAR', 0, None, 0),
 (6, 'city', 'VARCHAR', 0, None, 0),
 (7, 'state', 'VARCHAR', 0, None, 0),
 (8, 'zip', 'VARCHAR', 0, None, 0),
 (9, 'amount', 'INTEGER', 0, None, 0),
 (10, 'date', 'DATETIME', 0, None, 0),
 (11, 'candidate_id', 'INTEGER', 1, None, 0),
 (12, 'name', '', 0, None, 0)]

In [21]:
cont_cols = [e[1] for e in make_query("PRAGMA table_info(contributors);")]
cont_cols

['id',
 'last_name',
 'first_name',
 'middle_name',
 'street_1',
 'street_2',
 'city',
 'state',
 'zip',
 'amount',
 'date',
 'candidate_id']

In [18]:
def make_frame_old_version(list_of_tuples, legend=cont_cols):
    framelist=[]
    for i, cname in enumerate(legend):
        framelist.append((cname, [e[i] for e in list_of_tuples]))
    return pd.DataFrame.from_items(framelist)

In [22]:
def make_frame(list_of_tuples, legend=cont_cols):
    framelist=[]
    for i, cname in enumerate(legend):
        framelist.append((cname, [e[i] for e in list_of_tuples]))
    return pd.DataFrame.from_dict(dict(framelist))

In [20]:
out = make_query("SELECT * FROM contributors WHERE state='VA' AND amount <400;")
print(out)
print('\n\n')
make_frame(out)

[(78, 'Ranganath', 'Anoop', None, '2507 Willard Drive', None, 'Charlottesville', 'VA', '22903', -100, '2008-04-21', 32, 'junk'), (253, 'Ranganath', 'Anoop', None, '2507 Willard Drive', None, 'Charlottesville', 'VA', '22903', -100, '2008-04-21', 32, 'junk'), (89, 'Perreault', 'Louise', None, '503 Brockridge Hunt Drive', None, 'Hampton', 'VA', '23666', -34.08, '2008-04-21', 32, 'junk'), (264, 'Perreault', 'Louise', None, '503 Brockridge Hunt Drive', None, 'Hampton', 'VA', '23666', -34.08, '2008-04-21', 32, 'junk'), (146, 'ABDELLA', 'THOMAS', 'M.', '4231 MONUMENT WALL WAY #340', None, 'FAIRFAX', 'VA', '220308440', 50, '2007-09-30', 35, 'junk'), (321, 'ABDELLA', 'THOMAS', 'M.', '4231 MONUMENT WALL WAY #340', None, 'FAIRFAX', 'VA', '220308440', 50, '2007-09-30', 35, 'junk'), (28, 'Buckheit', 'Bruce', None, '8904 KAREN DR', None, 'FAIRFAX', 'VA', '220312731', 100, '2007-09-19', 20, 'junk'), (203, 'Buckheit', 'Bruce', None, '8904 KAREN DR', None, 'FAIRFAX', 'VA', '220312731', 100, '2007-09-19', 20, 'junk')]

    id  last_name first_name middle_name                     street_1 street_2             city state        zip  amount        date  candidate_id  name
0   78  Ranganath      Anoop        None           2507 Willard Drive     None  Charlottesville    VA      22903 -100.00  2008-04-21            32  junk
1  253  Ranganath      Anoop        None           2507 Willard Drive     None  Charlottesville    VA      22903 -100.00  2008-04-21            32  junk
2   89  Perreault     Louise        None    503 Brockridge Hunt Drive     None          Hampton    VA      23666  -34.08  2008-04-21            32  junk
3  264  Perreault     Louise        None    503 Brockridge Hunt Drive     None          Hampton    VA      23666  -34.08  2008-04-21            32  junk
4  146    ABDELLA     THOMAS          M.  4231 MONUMENT WALL WAY #340     None          FAIRFAX    VA  220308440   50.00  2007-09-30            35  junk
5  321    ABDELLA     THOMAS          M.  4231 MONUMENT WALL WAY #340     None          FAIRFAX    VA  220308440   50.00  2007-09-30            35  junk
6   28   Buckheit      Bruce        None                8904 KAREN DR     None          FAIRFAX    VA  220312731  100.00  2007-09-19            20  junk
7  203   Buckheit      Bruce        None                8904 KAREN DR     None          FAIRFAX    VA  220312731  100.00  2007-09-19            20  junk

In [21]:
out = make_query("SELECT * FROM contributors WHERE state IS NULL;")
make_frame(out)

    id last_name first_name middle_name       street_1 street_2        city state   zip  amount        date  candidate_id            name
0  126    BOURNE     TRAVIS        None  LAGE KAART 77     None  BRASSCHATT  None  2930    -500  2008-11-20            35  BOURNE, TRAVIS
1  301    BOURNE     TRAVIS        None  LAGE KAART 77     None  BRASSCHATT  None  2930    -500  2008-11-20            35  BOURNE, TRAVIS

In [25]:
dfcwci[dfcwci.state.isnull()]

    last_name first_name middle_name       street_1 street_2        city state   zip  amount        date  candidate_id
125    BOURNE     TRAVIS         NaN  LAGE KAART 77      NaN  BRASSCHATT   NaN  2930  -500.0  2008-11-20            35

In [62]:
out = make_query("SELECT * FROM contributors WHERE state IN ('VA', 'WA');")
make_frame(out).head(10)

    id  last_name first_name middle_name                      street_1 street_2             city state        zip  amount        date  candidate_id
0    1       Agee     Steven        None        549 Laurel Branch Road     None            Floyd    VA      24091  500.00  2007-06-30            16
1   28   Buckheit      Bruce        None                 8904 KAREN DR     None          FAIRFAX    VA  220312731  100.00  2007-09-19            20
2   63      BURKE    SUZANNE          M.                 3401 EVANSTON     None          SEATTLE    WA  981038677 -700.00  2008-03-05            22
3   78  Ranganath      Anoop        None            2507 Willard Drive     None  Charlottesville    VA      22903 -100.00  2008-04-21            32
4   89  Perreault     Louise        None     503 Brockridge Hunt Drive     None          Hampton    VA      23666  -34.08  2008-04-21            32
5  101   Aaronson    Rebecca        None  2000 Village Green Dr Apt 12     None       Mill Creek    WA  980125787  100.00  2008-02-08            34
6  107   Aaronson    Rebecca        None  2000 Village Green Dr Apt 12     None       Mill Creek    WA  980125787  100.00  2008-02-14            34
7  146    ABDELLA     THOMAS          M.   4231 MONUMENT WALL WAY #340     None          FAIRFAX    VA  220308440   50.00  2007-09-30            35

In [63]:
dfcwci[dfcwci.state.isin(['VA', 'WA'])].head(10)

     last_name first_name middle_name                      street_1 street_2             city state        zip  amount        date  candidate_id
0         Agee     Steven         NaN        549 Laurel Branch Road      NaN            Floyd    VA      24091  500.00  2007-06-30            16
27    Buckheit      Bruce         NaN                 8904 KAREN DR      NaN          FAIRFAX    VA  220312731  100.00  2007-09-19            20
62       BURKE    SUZANNE          M.                 3401 EVANSTON      NaN          SEATTLE    WA  981038677 -700.00  2008-03-05            22
77   Ranganath      Anoop         NaN            2507 Willard Drive      NaN  Charlottesville    VA      22903 -100.00  2008-04-21            32
88   Perreault     Louise         NaN     503 Brockridge Hunt Drive      NaN          Hampton    VA      23666  -34.08  2008-04-21            32
100   Aaronson    Rebecca         NaN  2000 Village Green Dr Apt 12      NaN       Mill Creek    WA  980125787  100.00  2008-02-08            34
106   Aaronson    Rebecca         NaN  2000 Village Green Dr Apt 12      NaN       Mill Creek    WA  980125787  100.00  2008-02-14            34
145    ABDELLA     THOMAS          M.   4231 MONUMENT WALL WAY #340      NaN          FAIRFAX    VA  220308440   50.00  2007-09-30            35

In [64]:
out=make_query("SELECT * FROM contributors WHERE amount BETWEEN 10 AND 50")
make_frame(out).head(10)

    id last_name first_name middle_name                    street_1 street_2           city state        zip  amount        date  candidate_id
0    3    Ahrens        Don        None        4034 Rennellwood Way     None     Pleasanton    CA      94566      50  2007-06-18            16
1   19     Ardle    William        None           412 Dakota Avenue     None    Springfield    OH      45504      50  2007-06-28            16
2   26   Buckler      Steve        None             24351 Armada Dr     None     Dana Point    CA  926291306      50  2007-07-30            20
3   27   Buckler      Steve        None             24351 Armada Dr     None     Dana Point    CA  926291306      25  2007-08-16            20
4   35      Buck    Barbara        None            1780 NE 138th St     None    North Miami    FL  331811316      50  2007-09-13            20
5   36      Buck    Barbara        None            1780 NE 138th St     None    North Miami    FL  331811316      50  2007-07-19            20
6   39  Buchanek  Elizabeth        None            7917 Kentbury Dr     None       Bethesda    MD  208144615      50  2007-09-30            20
7   50  Harrison       Ryan        None                 2247 3rd St     None       La Verne    CA  917504918      25  2007-07-26            20
8  102    Aarons     Elaine        None  481 Buck Island Rd Apt 17A  APT 17A  West Yarmouth    MA   26733300      25  2008-02-26            34
9  105     Aaron    Shirley        None              101 Cherry Ave     None         Havana    FL  323331311      50  2008-02-29            34

In [65]:
dfcwci.query("10 <= amount <= 50").head(10)

    last_name first_name middle_name                    street_1 street_2           city state        zip  amount        date  candidate_id
2      Ahrens        Don         NaN        4034 Rennellwood Way      NaN     Pleasanton    CA      94566    50.0  2007-06-18            16
18      Ardle    William         NaN           412 Dakota Avenue      NaN    Springfield    OH      45504    50.0  2007-06-28            16
25    Buckler      Steve         NaN             24351 Armada Dr      NaN     Dana Point    CA  926291306    50.0  2007-07-30            20
26    Buckler      Steve         NaN             24351 Armada Dr      NaN     Dana Point    CA  926291306    25.0  2007-08-16            20
34       Buck    Barbara         NaN            1780 NE 138th St      NaN    North Miami    FL  331811316    50.0  2007-09-13            20
35       Buck    Barbara         NaN            1780 NE 138th St      NaN    North Miami    FL  331811316    50.0  2007-07-19            20
38   Buchanek  Elizabeth         NaN            7917 Kentbury Dr      NaN       Bethesda    MD  208144615    50.0  2007-09-30            20
49   Harrison       Ryan         NaN                 2247 3rd St      NaN       La Verne    CA  917504918    25.0  2007-07-26            20
101    Aarons     Elaine         NaN  481 Buck Island Rd Apt 17A  APT 17A  West Yarmouth    MA   26733300    25.0  2008-02-26            34
104     Aaron    Shirley         NaN              101 Cherry Ave      NaN         Havana    FL  323331311    50.0  2008-02-29            34

In [70]:
dfcwci.sort_values('amount', ascending=False).head(10)

      last_name first_name middle_name                 street_1 street_2           city state        zip  amount        date  candidate_id
30       Buckel      Linda         NaN            PO Box 683130      NaN      Park City    UT  840683130  4600.0  2007-08-14            20
159       ABATE      MARIA       ELENA  1291 NIGHTINGALE AVENUE      NaN  MIAMI SPRINGS    FL  331663832  2600.0  2008-01-25            37
15      Anthony       John         NaN    211 Long Island Drive      NaN    Hot Springs    AR      71913  2300.0  2007-06-12            16
33         Buck     Blaine           M             45 Eaton Ave      NaN         Camden    ME   48431752  2300.0  2007-09-30            20
28       Buckel      Linda         NaN            PO Box 683130      NaN      Park City    UT  840683130  2300.0  2007-08-14            20
21        Baker      David         NaN   2550 Adamsbrooke Drive      NaN         Conway    AR      72034  2300.0  2007-04-11            16
13        Altes       R.D.         NaN          8600 Moody Road      NaN     Fort Smith    AR      72903  2300.0  2007-06-21            16
135  ABRAMOWITZ       NIRA         NaN          411 HARBOR ROAD      NaN      SOUTHPORT    CT   68901376  2300.0  2007-09-14            35
5          Akin       Mike         NaN         181 Baywood Lane      NaN     Monticello    AR      71655  1500.0  2007-05-18            16
174     ABRAHAM      SALEM          A.               P.O. BOX 7      NaN       CANADIAN    TX  790140007  1300.0  2008-01-30            37

In [72]:
out=make_query("SELECT * FROM contributors ORDER BY amount DESC;")
make_frame(out).head(10)

    id   last_name first_name middle_name                 street_1 street_2           city state        zip  amount        date  candidate_id
0   31      Buckel      Linda        None            PO Box 683130     None      Park City    UT  840683130  4600.0  2007-08-14            20
1  160       ABATE      MARIA       ELENA  1291 NIGHTINGALE AVENUE     None  MIAMI SPRINGS    FL  331663832  2600.0  2008-01-25            37
2   14       Altes       R.D.        None          8600 Moody Road     None     Fort Smith    AR      72903  2300.0  2007-06-21            16
3   16     Anthony       John        None    211 Long Island Drive     None    Hot Springs    AR      71913  2300.0  2007-06-12            16
4   22       Baker      David        None   2550 Adamsbrooke Drive     None         Conway    AR      72034  2300.0  2007-04-11            16
5   29      Buckel      Linda        None            PO Box 683130     None      Park City    UT  840683130  2300.0  2007-08-14            20
6   34        Buck     Blaine           M             45 Eaton Ave     None         Camden    ME   48431752  2300.0  2007-09-30            20
7  136  ABRAMOWITZ       NIRA        None          411 HARBOR ROAD     None      SOUTHPORT    CT   68901376  2300.0  2007-09-14            35
8    6        Akin       Mike        None         181 Baywood Lane     None     Monticello    AR      71655  1500.0  2007-05-18            16
9   10       Allen    John D.        None   1052 Cannon Mill Drive     None  North Augusta    SC      29860  1300.0  2007-06-29            16

In [3]:
db = sq3.connect(os.path.join(PATHSTART, "./cancont.db"))

In [27]:
out = make_query("SELECT * FROM contributors ORDER BY amount DESC;")

In [28]:
make_frame(out).head(10)

    id   last_name first_name middle_name                 street_1 street_2           city state        zip  amount        date  candidate_id
0   31      Buckel      Linda        None            PO Box 683130     None      Park City    UT  840683130  4600.0  2007-08-14            20
1  206      Buckel      Linda        None            PO Box 683130     None      Park City    UT  840683130  4600.0  2007-08-14            20
2  160       ABATE      MARIA       ELENA  1291 NIGHTINGALE AVENUE     None  MIAMI SPRINGS    FL  331663832  2600.0  2008-01-25            37
3  335       ABATE      MARIA       ELENA  1291 NIGHTINGALE AVENUE     None  MIAMI SPRINGS    FL  331663832  2600.0  2008-01-25            37
4   14       Altes       R.D.        None          8600 Moody Road     None     Fort Smith    AR      72903  2300.0  2007-06-21            16
5   16     Anthony       John        None    211 Long Island Drive     None    Hot Springs    AR      71913  2300.0  2007-06-12            16
6   22       Baker      David        None   2550 Adamsbrooke Drive     None         Conway    AR      72034  2300.0  2007-04-11            16
7   29      Buckel      Linda        None            PO Box 683130     None      Park City    UT  840683130  2300.0  2007-08-14            20
8   34        Buck     Blaine           M             45 Eaton Ave     None         Camden    ME   48431752  2300.0  2007-09-30            20
9  136  ABRAMOWITZ       NIRA        None          411 HARBOR ROAD     None      SOUTHPORT    CT   68901376  2300.0  2007-09-14            35

In [29]:
dfcwci[['first_name', 'amount']].head(10)

  first_name  amount
0     Steven   500.0
1        Don   250.0
2        Don    50.0
3        Don   100.0
4    Charles   100.0
5       Mike  1500.0
6    Rebecca   500.0
7    Brittni   250.0
8    John D.  1000.0
9    John D.  1300.0

In [30]:
out = make_query("SELECT first_name, amount FROM contributors;")
make_frame(out, ['first_name', 'amount']).head(10)

  first_name  amount
0     Steven   500.0
1        Don   250.0
2        Don    50.0
3        Don   100.0
4    Charles   100.0
5       Mike  1500.0
6    Rebecca   500.0
7    Brittni   250.0
8    John D.  1000.0
9    John D.  1300.0

In [31]:
dfcwci[['last_name', 'first_name']].count()

last_name     175
first_name    175
dtype: int64

In [32]:
dfcwci[['last_name', 'first_name']].drop_duplicates().count()

last_name     126
first_name    126
dtype: int64

In [33]:
dfcwci[['last_name', 'first_name']].drop_duplicates().head(10)

   last_name first_name
0       Agee     Steven
1     Ahrens        Don
4       Akin    Charles
5       Akin       Mike
6       Akin    Rebecca
7   Aldridge    Brittni
8      Allen    John D.
10   Allison    John W.
11   Allison    Rebecca
13     Altes       R.D.

In [34]:
out=make_query("SELECT DISTINCT last_name, first_name FROM contributors;")
make_frame(out, ['last_name', 'first_name']).head(10)

  last_name first_name
0      Agee     Steven
1    Ahrens        Don
2      Akin    Charles
3      Akin       Mike
4      Akin    Rebecca
5  Aldridge    Brittni
6     Allen    John D.
7   Allison    John W.
8   Allison    Rebecca
9     Altes       R.D.

In [35]:
dfcwci['name'] = dfcwci['last_name']+", "+dfcwci['first_name']
dfcwci.head(10)

  last_name first_name middle_name                      street_1 street_2           city state    zip  amount        date  candidate_id               name
0      Agee     Steven         NaN        549 Laurel Branch Road      NaN          Floyd    VA  24091   500.0  2007-06-30            16       Agee, Steven
1    Ahrens        Don         NaN          4034 Rennellwood Way      NaN     Pleasanton    CA  94566   250.0  2007-05-16            16        Ahrens, Don
2    Ahrens        Don         NaN          4034 Rennellwood Way      NaN     Pleasanton    CA  94566    50.0  2007-06-18            16        Ahrens, Don
3    Ahrens        Don         NaN          4034 Rennellwood Way      NaN     Pleasanton    CA  94566   100.0  2007-06-21            16        Ahrens, Don
4      Akin    Charles         NaN        10187 Sugar Creek Road      NaN    Bentonville    AR  72712   100.0  2007-06-16            16      Akin, Charles
5      Akin       Mike         NaN              181 Baywood Lane      NaN     Monticello    AR  71655  1500.0  2007-05-18            16         Akin, Mike
6      Akin    Rebecca         NaN              181 Baywood Lane      NaN     Monticello    AR  71655   500.0  2007-05-18            16      Akin, Rebecca
7  Aldridge    Brittni         NaN  808 Capitol Square Place, SW      NaN     Washington    DC  20024   250.0  2007-06-06            16  Aldridge, Brittni
8     Allen    John D.         NaN        1052 Cannon Mill Drive      NaN  North Augusta    SC  29860  1000.0  2007-06-11            16     Allen, John D.
9     Allen    John D.         NaN        1052 Cannon Mill Drive      NaN  North Augusta    SC  29860  1300.0  2007-06-29            16     Allen, John D.

In [36]:
dfcwci.assign(ucname=dfcwci.last_name+":"+dfcwci.first_name).head(10)

  last_name first_name middle_name                      street_1 street_2           city state    zip  amount        date  candidate_id               name            ucname
0      Agee     Steven         NaN        549 Laurel Branch Road      NaN          Floyd    VA  24091   500.0  2007-06-30            16       Agee, Steven       Agee:Steven
1    Ahrens        Don         NaN          4034 Rennellwood Way      NaN     Pleasanton    CA  94566   250.0  2007-05-16            16        Ahrens, Don        Ahrens:Don
2    Ahrens        Don         NaN          4034 Rennellwood Way      NaN     Pleasanton    CA  94566    50.0  2007-06-18            16        Ahrens, Don        Ahrens:Don
3    Ahrens        Don         NaN          4034 Rennellwood Way      NaN     Pleasanton    CA  94566   100.0  2007-06-21            16        Ahrens, Don        Ahrens:Don
4      Akin    Charles         NaN        10187 Sugar Creek Road      NaN    Bentonville    AR  72712   100.0  2007-06-16            16      Akin, Charles      Akin:Charles
5      Akin       Mike         NaN              181 Baywood Lane      NaN     Monticello    AR  71655  1500.0  2007-05-18            16         Akin, Mike         Akin:Mike
6      Akin    Rebecca         NaN              181 Baywood Lane      NaN     Monticello    AR  71655   500.0  2007-05-18            16      Akin, Rebecca      Akin:Rebecca
7  Aldridge    Brittni         NaN  808 Capitol Square Place, SW      NaN     Washington    DC  20024   250.0  2007-06-06            16  Aldridge, Brittni  Aldridge:Brittni
8     Allen    John D.         NaN        1052 Cannon Mill Drive      NaN  North Augusta    SC  29860  1000.0  2007-06-11            16     Allen, John D.     Allen:John D.
9     Allen    John D.         NaN        1052 Cannon Mill Drive      NaN  North Augusta    SC  29860  1300.0  2007-06-29            16     Allen, John D.     Allen:John D.

In [37]:
dfcwci.head(10)

  last_name first_name middle_name                      street_1 street_2           city state    zip  amount        date  candidate_id               name
0      Agee     Steven         NaN        549 Laurel Branch Road      NaN          Floyd    VA  24091   500.0  2007-06-30            16       Agee, Steven
1    Ahrens        Don         NaN          4034 Rennellwood Way      NaN     Pleasanton    CA  94566   250.0  2007-05-16            16        Ahrens, Don
2    Ahrens        Don         NaN          4034 Rennellwood Way      NaN     Pleasanton    CA  94566    50.0  2007-06-18            16        Ahrens, Don
3    Ahrens        Don         NaN          4034 Rennellwood Way      NaN     Pleasanton    CA  94566   100.0  2007-06-21            16        Ahrens, Don
4      Akin    Charles         NaN        10187 Sugar Creek Road      NaN    Bentonville    AR  72712   100.0  2007-06-16            16      Akin, Charles
5      Akin       Mike         NaN              181 Baywood Lane      NaN     Monticello    AR  71655  1500.0  2007-05-18            16         Akin, Mike
6      Akin    Rebecca         NaN              181 Baywood Lane      NaN     Monticello    AR  71655   500.0  2007-05-18            16      Akin, Rebecca
7  Aldridge    Brittni         NaN  808 Capitol Square Place, SW      NaN     Washington    DC  20024   250.0  2007-06-06            16  Aldridge, Brittni
8     Allen    John D.         NaN        1052 Cannon Mill Drive      NaN  North Augusta    SC  29860  1000.0  2007-06-11            16     Allen, John D.
9     Allen    John D.         NaN        1052 Cannon Mill Drive      NaN  North Augusta    SC  29860  1300.0  2007-06-29            16     Allen, John D.

In [38]:
dfcwci[dfcwci.state=='VA']

     last_name first_name middle_name                     street_1 street_2             city state        zip  amount        date  candidate_id               name
0         Agee     Steven         NaN       549 Laurel Branch Road      NaN            Floyd    VA      24091  500.00  2007-06-30            16       Agee, Steven
27    Buckheit      Bruce         NaN                8904 KAREN DR      NaN          FAIRFAX    VA  220312731  100.00  2007-09-19            20    Buckheit, Bruce
77   Ranganath      Anoop         NaN           2507 Willard Drive      NaN  Charlottesville    VA      22903 -100.00  2008-04-21            32   Ranganath, Anoop
88   Perreault     Louise         NaN    503 Brockridge Hunt Drive      NaN          Hampton    VA      23666  -34.08  2008-04-21            32  Perreault, Louise
145    ABDELLA     THOMAS          M.  4231 MONUMENT WALL WAY #340      NaN          FAIRFAX    VA  220308440   50.00  2007-09-30            35    ABDELLA, THOMAS

In [40]:
dfcwci.loc[dfcwci.state=="VA", 'name']

0           Agee, Steven
27       Buckheit, Bruce
77      Ranganath, Anoop
88     Perreault, Louise
145      ABDELLA, THOMAS
Name: name, dtype: object

In [41]:
dfcwci.query("state=='VA'")

     last_name first_name middle_name                     street_1 street_2             city state        zip  amount        date  candidate_id               name
0         Agee     Steven         NaN       549 Laurel Branch Road      NaN            Floyd    VA      24091  500.00  2007-06-30            16       Agee, Steven
27    Buckheit      Bruce         NaN                8904 KAREN DR      NaN          FAIRFAX    VA  220312731  100.00  2007-09-19            20    Buckheit, Bruce
77   Ranganath      Anoop         NaN           2507 Willard Drive      NaN  Charlottesville    VA      22903 -100.00  2008-04-21            32   Ranganath, Anoop
88   Perreault     Louise         NaN    503 Brockridge Hunt Drive      NaN          Hampton    VA      23666  -34.08  2008-04-21            32  Perreault, Louise
145    ABDELLA     THOMAS          M.  4231 MONUMENT WALL WAY #340      NaN          FAIRFAX    VA  220308440   50.00  2007-09-30            35    ABDELLA, THOMAS

In [42]:
alt = "ALTER TABLE contributors ADD COLUMN name;"
db.cursor().execute(alt)

In [43]:
make_query("PRAGMA table_info(contributors);")

[(0, 'id', 'INTEGER', 1, None, 1),
 (1, 'last_name', 'VARCHAR', 0, None, 0),
 (2, 'first_name', 'VARCHAR', 0, None, 0),
 (3, 'middle_name', 'VARCHAR', 0, None, 0),
 (4, 'street_1', 'VARCHAR', 0, None, 0),
 (5, 'street_2', 'VARCHAR', 0, None, 0),
 (6, 'city', 'VARCHAR', 0, None, 0),
 (7, 'state', 'VARCHAR', 0, None, 0),
 (8, 'zip', 'VARCHAR', 0, None, 0),
 (9, 'amount', 'INTEGER', 0, None, 0),
 (10, 'date', 'DATETIME', 0, None, 0),
 (11, 'candidate_id', 'INTEGER', 1, None, 0),
 (12, 'name', '', 0, None, 0)]

In [44]:
out = make_query("SELECT id, last_name, first_name from contributors;")
out2 = [(e[1]+ ", " + e[2], e[0]) for e in out]
out2

[('Agee, Steven', 1),
 ('Ahrens, Don', 2),
 ('Ahrens, Don', 3),
 ('Ahrens, Don', 4),
 ('Akin, Charles', 5),
 ('Akin, Mike', 6),
 ('Akin, Rebecca', 7),
 ('Aldridge, Brittni', 8),
 ('Allen, John D.', 9),
 ('Allen, John D.', 10),
 ('Allison, John W.', 11),
 ('Allison, Rebecca', 12),
 ('Allison, Rebecca', 13),
 ('Altes, R.D.', 14),
 ('Andres, Dale', 15),
 ('Anthony, John', 16),
 ('Arbogast, Robert', 17),
 ('Arbogast, Robert', 18),
 ('Ardle, William', 19),
 ('Atiq, Omar', 20),
 ('Atiq, Omar', 21),
 ('Baker, David', 22),
 ('Bancroft, David', 23),
 ('Banks, Charles', 24),
 ('Barbee, John', 25),
 ('Buckler, Steve', 26),
 ('Buckler, Steve', 27),
 ('Buckheit, Bruce', 28),
 ('Buckel, Linda', 29),
 ('Buckel, Linda', 30),
 ('Buckel, Linda', 31),
 ('Buck, Thomas', 32),
 ('Buck, Jay', 33),
 ('Buck, Blaine', 34),
 ('Buck, Barbara', 35),
 ('Buck, Barbara', 36),
 ('Buchman, Mark M', 37),
 ('Bucher, Ida', 38),
 ('Buchanek, Elizabeth', 39),
 ('Buchanan, John', 40),
 ('Buchanan, John', 41),
 ('Buchanan, John', 42),
 ('Buchanan, John', 43),
 ('Buchanan, John', 44),
 ('Buchanan, John', 45),
 ('Buchanan, John', 46),
 ('Buchanan, John', 47),
 ('Buchanan, John', 48),
 ('Buchanan, John', 49),
 ('Harrison, Ryan', 50),
 ('BYNUM, HERBERT', 51),
 ('BYINGTON, MARGARET', 52),
 ('BYERS, BOB', 53),
 ('BYERS, AUDREY', 54),
 ('BUSH, KRYSTIE', 55),
 ('BUSH, ERIC', 56),
 ('BURTON, SUSAN', 57),
 ('BURTON, STEVEN', 58),
 ('BURTON, GLENN', 59),
 ('BURKHARDT, CRAIG', 60),
 ('BURKHARDT, CRAIG', 61),
 ('BURKHARDT, BARBARA', 62),
 ('BURKE, SUZANNE', 63),
 ('BURKE, GAIL', 64),
 ('BURKE, DONALD', 65),
 ('BURGERT, RONALD', 66),
 ('BULL, BARTLE', 67),
 ('BULL, BARTLE', 68),
 ('BUKOWSKI, DANIEL', 69),
 ('BUISSON, MARGARET', 70),
 ('BUCKLEY, WALTER', 71),
 ('BUCKLEY, MARJORIE', 72),
 ('BRUNO, JOHN', 73),
 ('BRUNO, IRENE', 74),
 ('BROWN, TIMOTHY', 75),
 ('Schuff, Bryan', 76),
 ('Hobbs, James', 77),
 ('Ranganath, Anoop', 78),
 ('Nystrom, Michael', 79),
 ('Muse, Nina', 80),
 ('Waddell, James', 81),
 ('Brucks, William', 82),
 ('Kuehn, David', 83),
 ('Verster, Jeanette', 84),
 ('Uihlein, Richard', 85),
 ('Eskenberry, Robert', 86),
 ('Froehling, Alan', 87),
 ('Duryea, Marcia', 88),
 ('Perreault, Louise', 89),
 ('Rozenfeld, Timur', 90),
 ('Kazor, Christopher', 91),
 ('Lehner, Thomas', 92),
 ('Plummer, Joseph', 93),
 ('Raught, Philip', 94),
 ('Ferrara, Judith', 95),
 ('Johnson, Cathleen', 96),
 ('Sanford, Bradley', 97),
 ('Gaarder, Bruce', 98),
 ('Choe, Hyeokchan', 99),
 ('Jacobs, Richard', 100),
 ('Aaronson, Rebecca', 101),
 ('Aarons, Elaine', 102),
 ('Aarons, Elaine', 103),
 ('Aarons, Elaine', 104),
 ('Aaron, Shirley', 105),
 ('Aaron, Shirley', 106),
 ('Aaronson, Rebecca', 107),
 ('Aaron, Shirley', 108),
 ('Aaron, Shirley', 109),
 ('Aaron, Shirley', 110),
 ('Reid, Elizabeth', 111),
 ('Reich, Thomas', 112),
 ('Aaron, Shirley', 113),
 ('Aaron, Shirley', 114),
 ('Aaron, Sharron', 115),
 ('Aaron, Patricia', 116),
 ('Aaron, Patricia', 117),
 ('Aaron, Jim', 118),
 ('Aaron, Jim', 119),
 ('Aaron, Carole', 120),
 ('Aaron, Carole', 121),
 ('Aaron, Carole', 122),
 ('Aaron, Barbara', 123),
 ('Aanonsen, Lin', 124),
 ('Aanonsen, Lin', 125),
 ('BOURNE, TRAVIS', 126),
 ('SECRIST, BRIAN', 127),
 ('TOLLESTRUP, TRAVIS', 128),
 ('ACCORD, DEAN', 129),
 ('ABTS, HENRY', 130),
 ('ABSHIER, LANNY', 131),
 ('ABSHIER, DIANA', 132),
 ('ABREU, KEVIN', 133),
 ('ABREU, KEVIN', 134),
 ('ABREU, KEVIN', 135),
 ('ABRAMOWITZ, NIRA', 136),
 ('ABRAMS, MICHAEL', 137),
 ('ABRAMOWITZ, KEN', 138),
 ('ABOUBAKARE, NASAR', 139),
 ('ABEGG, PATRICIA', 140),
 ('ABEGG, PATRICIA', 141),
 ('ABEGG, PATRICIA', 142),
 ('ABEGG, PATRICIA', 143),
 ('ABEGG, PATRICIA', 144),
 ('ABEGG, PATRICIA', 145),
 ('ABDELLA, THOMAS', 146),
 ('ABBOTT, WELDON', 147),
 ('ABBOTT, WELDON', 148),
 ('ABBOTT, GERALD', 149),
 ('ABBOTT, GERALD', 150),
 ('ABEDIN, ZAINUL', 151),
 ('ABBOTT, SYBIL', 152),
 ('ABBOTT, SYBIL', 153),
 ('ABBOTT, RONALD', 154),
 ('ABBOTT, RONALD', 155),
 ('ABBOTT, ROBERT', 156),
 ('ABBOTT, MIKE', 157),
 ('ABBOT, DAVID', 158),
 ('ABBO, PAULINE', 159),
 ('ABATE, MARIA', 160),
 ('ABAIR, PETER', 161),
 ('ABACHERLI, SHIRLEY', 162),
 ('AARONS, CHARLES', 163),
 ('AARONS, CHARLES', 164),
 ('AARONS, CHARLES', 165),
 ('ABEL, JOHN', 166),
 ('ABEL, MARLING', 167),
 ('ABEL, RUDOLPH', 168),
 ('ABELE, RODNEY', 169),
 ('ABERCROMBIE, DENIS', 170),
 ('ABESHAUS, MERRILL', 171),
 ('ABRAHAM, GEORGE', 172),
 ('ABRAHAMSON, PETER', 173),
 ('ABRAHAM, SALEM', 174),
 ('ABRAHAM, SALEM', 175),
 ('Agee, Steven', 176),
 ('Ahrens, Don', 177),
 ('Ahrens, Don', 178),
 ('Ahrens, Don', 179),
 ('Akin, Charles', 180),
 ('Akin, Mike', 181),
 ('Akin, Rebecca', 182),
 ('Aldridge, Brittni', 183),
 ('Allen, John D.', 184),
 ('Allen, John D.', 185),
 ('Allison, John W.', 186),
 ('Allison, Rebecca', 187),
 ('Allison, Rebecca', 188),
 ('Altes, R.D.', 189),
 ('Andres, Dale', 190),
 ('Anthony, John', 191),
 ('Arbogast, Robert', 192),
 ('Arbogast, Robert', 193),
 ('Ardle, William', 194),
 ('Atiq, Omar', 195),
 ('Atiq, Omar', 196),
 ('Baker, David', 197),
 ('Bancroft, David', 198),
 ('Banks, Charles', 199),
 ('Barbee, John', 200),
 ('Buckler, Steve', 201),
 ('Buckler, Steve', 202),
 ('Buckheit, Bruce', 203),
 ('Buckel, Linda', 204),
 ('Buckel, Linda', 205),
 ('Buckel, Linda', 206),
 ('Buck, Thomas', 207),
 ('Buck, Jay', 208),
 ('Buck, Blaine', 209),
 ('Buck, Barbara', 210),
 ('Buck, Barbara', 211),
 ('Buchman, Mark M', 212),
 ('Bucher, Ida', 213),
 ('Buchanek, Elizabeth', 214),
 ('Buchanan, John', 215),
 ('Buchanan, John', 216),
 ('Buchanan, John', 217),
 ('Buchanan, John', 218),
 ('Buchanan, John', 219),
 ('Buchanan, John', 220),
 ('Buchanan, John', 221),
 ('Buchanan, John', 222),
 ('Buchanan, John', 223),
 ('Buchanan, John', 224),
 ('Harrison, Ryan', 225),
 ('BYNUM, HERBERT', 226),
 ('BYINGTON, MARGARET', 227),
 ('BYERS, BOB', 228),
 ('BYERS, AUDREY', 229),
 ('BUSH, KRYSTIE', 230),
 ('BUSH, ERIC', 231),
 ('BURTON, SUSAN', 232),
 ('BURTON, STEVEN', 233),
 ('BURTON, GLENN', 234),
 ('BURKHARDT, CRAIG', 235),
 ('BURKHARDT, CRAIG', 236),
 ('BURKHARDT, BARBARA', 237),
 ('BURKE, SUZANNE', 238),
 ('BURKE, GAIL', 239),
 ('BURKE, DONALD', 240),
 ('BURGERT, RONALD', 241),
 ('BULL, BARTLE', 242),
 ('BULL, BARTLE', 243),
 ('BUKOWSKI, DANIEL', 244),
 ('BUISSON, MARGARET', 245),
 ('BUCKLEY, WALTER', 246),
 ('BUCKLEY, MARJORIE', 247),
 ('BRUNO, JOHN', 248),
 ('BRUNO, IRENE', 249),
 ('BROWN, TIMOTHY', 250),
 ('Schuff, Bryan', 251),
 ('Hobbs, James', 252),
 ('Ranganath, Anoop', 253),
 ('Nystrom, Michael', 254),
 ('Muse, Nina', 255),
 ('Waddell, James', 256),
 ('Brucks, William', 257),
 ('Kuehn, David', 258),
 ('Verster, Jeanette', 259),
 ('Uihlein, Richard', 260),
 ('Eskenberry, Robert', 261),
 ('Froehling, Alan', 262),
 ('Duryea, Marcia', 263),
 ('Perreault, Louise', 264),
 ('Rozenfeld, Timur', 265),
 ('Kazor, Christopher', 266),
 ('Lehner, Thomas', 267),
 ('Plummer, Joseph', 268),
 ('Raught, Philip', 269),
 ('Ferrara, Judith', 270),
 ('Johnson, Cathleen', 271),
 ('Sanford, Bradley', 272),
 ('Gaarder, Bruce', 273),
 ('Choe, Hyeokchan', 274),
 ('Jacobs, Richard', 275),
 ('Aaronson, Rebecca', 276),
 ('Aarons, Elaine', 277),
 ('Aarons, Elaine', 278),
 ('Aarons, Elaine', 279),
 ('Aaron, Shirley', 280),
 ('Aaron, Shirley', 281),
 ('Aaronson, Rebecca', 282),
 ('Aaron, Shirley', 283),
 ('Aaron, Shirley', 284),
 ('Aaron, Shirley', 285),
 ('Reid, Elizabeth', 286),
 ('Reich, Thomas', 287),
 ('Aaron, Shirley', 288),
 ('Aaron, Shirley', 289),
 ('Aaron, Sharron', 290),
 ('Aaron, Patricia', 291),
 ('Aaron, Patricia', 292),
 ('Aaron, Jim', 293),
 ('Aaron, Jim', 294),
 ('Aaron, Carole', 295),
 ('Aaron, Carole', 296),
 ('Aaron, Carole', 297),
 ('Aaron, Barbara', 298),
 ('Aanonsen, Lin', 299),
 ('Aanonsen, Lin', 300),
 ('BOURNE, TRAVIS', 301),
 ('SECRIST, BRIAN', 302),
 ('TOLLESTRUP, TRAVIS', 303),
 ('ACCORD, DEAN', 304),
 ('ABTS, HENRY', 305),
 ('ABSHIER, LANNY', 306),
 ('ABSHIER, DIANA', 307),
 ('ABREU, KEVIN', 308),
 ('ABREU, KEVIN', 309),
 ('ABREU, KEVIN', 310),
 ('ABRAMOWITZ, NIRA', 311),
 ('ABRAMS, MICHAEL', 312),
 ('ABRAMOWITZ, KEN', 313),
 ('ABOUBAKARE, NASAR', 314),
 ('ABEGG, PATRICIA', 315),
 ('ABEGG, PATRICIA', 316),
 ('ABEGG, PATRICIA', 317),
 ('ABEGG, PATRICIA', 318),
 ('ABEGG, PATRICIA', 319),
 ('ABEGG, PATRICIA', 320),
 ('ABDELLA, THOMAS', 321),
 ('ABBOTT, WELDON', 322),
 ('ABBOTT, WELDON', 323),
 ('ABBOTT, GERALD', 324),
 ('ABBOTT, GERALD', 325),
 ('ABEDIN, ZAINUL', 326),
 ('ABBOTT, SYBIL', 327),
 ('ABBOTT, SYBIL', 328),
 ('ABBOTT, RONALD', 329),
 ('ABBOTT, RONALD', 330),
 ('ABBOTT, ROBERT', 331),
 ('ABBOTT, MIKE', 332),
 ('ABBOT, DAVID', 333),
 ('ABBO, PAULINE', 334),
 ('ABATE, MARIA', 335),
 ('ABAIR, PETER', 336),
 ('ABACHERLI, SHIRLEY', 337),
 ('AARONS, CHARLES', 338),
 ('AARONS, CHARLES', 339),
 ('AARONS, CHARLES', 340),
 ('ABEL, JOHN', 341),
 ('ABEL, MARLING', 342),
 ('ABEL, RUDOLPH', 343),
 ('ABELE, RODNEY', 344),
 ('ABERCROMBIE, DENIS', 345),
 ('ABESHAUS, MERRILL', 346),
 ('ABRAHAM, GEORGE', 347),
 ('ABRAHAMSON, PETER', 348),
 ('ABRAHAM, SALEM', 349),
 ('ABRAHAM, SALEM', 350)]

In [45]:
alt2 = "UPDATE contributors SET name = ? WHERE id = ?;"
for ele in out2:
    db.cursor().execute(alt2, ele)

In [46]:
db.commit()

In [47]:
out = make_query("SELECT * from contributors;")
make_frame(out, cont_cols+["name"]).head(10)

   id last_name first_name middle_name                      street_1 street_2           city state    zip  amount        date  candidate_id               name
0   1      Agee     Steven        None        549 Laurel Branch Road     None          Floyd    VA  24091   500.0  2007-06-30            16       Agee, Steven
1   2    Ahrens        Don        None          4034 Rennellwood Way     None     Pleasanton    CA  94566   250.0  2007-05-16            16        Ahrens, Don
2   3    Ahrens        Don        None          4034 Rennellwood Way     None     Pleasanton    CA  94566    50.0  2007-06-18            16        Ahrens, Don
3   4    Ahrens        Don        None          4034 Rennellwood Way     None     Pleasanton    CA  94566   100.0  2007-06-21            16        Ahrens, Don
4   5      Akin    Charles        None        10187 Sugar Creek Road     None    Bentonville    AR  72712   100.0  2007-06-16            16      Akin, Charles
5   6      Akin       Mike        None              181 Baywood Lane     None     Monticello    AR  71655  1500.0  2007-05-18            16         Akin, Mike
6   7      Akin    Rebecca        None              181 Baywood Lane     None     Monticello    AR  71655   500.0  2007-05-18            16      Akin, Rebecca
7   8  Aldridge    Brittni        None  808 Capitol Square Place, SW     None     Washington    DC  20024   250.0  2007-06-06            16  Aldridge, Brittni
8   9     Allen    John D.        None        1052 Cannon Mill Drive     None  North Augusta    SC  29860  1000.0  2007-06-11            16     Allen, John D.
9  10     Allen    John D.        None        1052 Cannon Mill Drive     None  North Augusta    SC  29860  1300.0  2007-06-29            16     Allen, John D.

In [48]:
upd = "UPDATE contributors SET name = 'junk' WHERE state = 'VA';"
db.cursor().execute(upd)
db.commit()

In [49]:
out=make_query("SELECT * from contributors where state='VA';")
make_frame(out, cont_cols + ['name']).head(10)

    id  last_name first_name middle_name                     street_1 street_2             city state        zip  amount        date  candidate_id  name
0    1       Agee     Steven        None       549 Laurel Branch Road     None            Floyd    VA      24091  500.00  2007-06-30            16  junk
1   28   Buckheit      Bruce        None                8904 KAREN DR     None          FAIRFAX    VA  220312731  100.00  2007-09-19            20  junk
2   78  Ranganath      Anoop        None           2507 Willard Drive     None  Charlottesville    VA      22903 -100.00  2008-04-21            32  junk
3   89  Perreault     Louise        None    503 Brockridge Hunt Drive     None          Hampton    VA      23666  -34.08  2008-04-21            32  junk
4  146    ABDELLA     THOMAS          M.  4231 MONUMENT WALL WAY #340     None          FAIRFAX    VA  220308440   50.00  2007-09-30            35  junk
5  176       Agee     Steven        None       549 Laurel Branch Road     None            Floyd    VA      24091  500.00  2007-06-30            16  junk
6  203   Buckheit      Bruce        None                8904 KAREN DR     None          FAIRFAX    VA  220312731  100.00  2007-09-19            20  junk
7  253  Ranganath      Anoop        None           2507 Willard Drive     None  Charlottesville    VA      22903 -100.00  2008-04-21            32  junk
8  264  Perreault     Louise        None    503 Brockridge Hunt Drive     None          Hampton    VA      23666  -34.08  2008-04-21            32  junk
9  321    ABDELLA     THOMAS          M.  4231 MONUMENT WALL WAY #340     None          FAIRFAX    VA  220308440   50.00  2007-09-30            35  junk

In [50]:
del dfcwci['name']

In [51]:
dfcwci

      last_name first_name middle_name                street_1 street_2          city state        zip  amount        date  candidate_id
0          Agee     Steven         NaN  549 Laurel Branch Road      NaN         Floyd    VA      24091   500.0  2007-06-30            16
1        Ahrens        Don         NaN    4034 Rennellwood Way      NaN    Pleasanton    CA      94566   250.0  2007-05-16            16
2        Ahrens        Don         NaN    4034 Rennellwood Way      NaN    Pleasanton    CA      94566    50.0  2007-06-18            16
3        Ahrens        Don         NaN    4034 Rennellwood Way      NaN    Pleasanton    CA      94566   100.0  2007-06-21            16
4          Akin    Charles         NaN  10187 Sugar Creek Road      NaN   Bentonville    AR      72712   100.0  2007-06-16            16
..          ...        ...         ...                     ...      ...           ...   ...        ...     ...         ...           ...
170    ABESHAUS    MERRILL          M.  1801 N. HEREFORD DRIVE      NaN     FLAGSTAFF    AZ  860011121   120.0  2008-01-16            37
171     ABRAHAM     GEORGE         NaN           P.O. BOX 1504      NaN  LAKE CHARLES    LA  706021504   800.0  2008-01-17            37
172  ABRAHAMSON      PETER          J.   1030 W. ROSCOE STREET      NaN       CHICAGO    IL  606572207    50.0  2008-01-25            37
173     ABRAHAM      SALEM          A.              P.O. BOX 7      NaN      CANADIAN    TX  790140007  1000.0  2008-01-17            37
174     ABRAHAM      SALEM          A.              P.O. BOX 7      NaN      CANADIAN    TX  790140007  1300.0  2008-01-30            37

[175 rows x 11 columns]

In [52]:
dfcwci.describe()

                zip       amount  candidate_id
count  1.750000e+02   175.000000    175.000000
mean   3.780014e+08     3.418114     28.000000
std    3.628278e+08  1028.418999      7.823484
min    2.474000e+03 -2592.000000     16.000000
25%    9.336700e+04  -175.000000     20.000000
50%    3.233313e+08   100.000000     32.000000
75%    7.816946e+08   300.000000     35.000000
max    9.951532e+08  4600.000000     37.000000

In [53]:
dfcwci.amount.max()

4600.0

In [54]:
dfcwci[dfcwci.amount==dfcwci.amount.max()]

   last_name first_name middle_name       street_1 street_2       city state        zip  amount        date  candidate_id
30    Buckel      Linda         NaN  PO Box 683130      NaN  Park City    UT  840683130  4600.0  2007-08-14            20

In [55]:
out=make_query("SELECT *, MAX(amount) as maxamt FROM contributors;")
print(out)
make_frame(out, cont_cols+['maxamt'])

[(31, 'Buckel', 'Linda', None, 'PO Box 683130', None, 'Park City', 'UT', '840683130', 4600, '2007-08-14', 20, 'Buckel, Linda', 4600)]

   id last_name first_name middle_name       street_1 street_2       city state        zip  amount        date  candidate_id         maxamt
0  31    Buckel      Linda        None  PO Box 683130     None  Park City    UT  840683130    4600  2007-08-14            20  Buckel, Linda

In [56]:
out=make_query("SELECT COUNT(amount) as AMOUNTCOUNT FROM contributors;")
print(out)

[(350,)]

In [57]:
out=make_query("SELECT AVG(amount) FROM contributors;")
print(out)

[(3.418114285714276,)]

In [58]:
dfcwci[dfcwci.amount > dfcwci.amount.max() - 2000]

   last_name first_name middle_name       street_1 street_2       city state        zip  amount        date  candidate_id
30    Buckel      Linda         NaN  PO Box 683130      NaN  Park City    UT  840683130  4600.0  2007-08-14            20

In [59]:
out=make_query("SELECT * FROM contributors WHERE amount > (select (MAX(amount) - 2300) FROM contributors);")
make_frame(out)

    id last_name first_name middle_name                 street_1 street_2           city state        zip  amount        date  candidate_id
0   31    Buckel      Linda        None            PO Box 683130     None      Park City    UT  840683130    4600  2007-08-14            20
1  160     ABATE      MARIA       ELENA  1291 NIGHTINGALE AVENUE     None  MIAMI SPRINGS    FL  331663832    2600  2008-01-25            37
2  206    Buckel      Linda        None            PO Box 683130     None      Park City    UT  840683130    4600  2007-08-14            20
3  335     ABATE      MARIA       ELENA  1291 NIGHTINGALE AVENUE     None  MIAMI SPRINGS    FL  331663832    2600  2008-01-25            37

In [60]:
dfcwci.groupby("state").sum()

               zip    amount  candidate_id
state
AK      2985459621   1210.00           111
AR          864790  14200.00           192
AZ       860011121    120.00            37
CA     14736360720  -5013.73           600
CO      2405477834  -5823.00           111
CT        68901376   2300.00            35
DC       800341853  -1549.91           102
FL      8970626520  -4050.00           803
IA           50266    250.00            16
ID           83648   -261.00            32
IL      3042068689  -5586.80           175
KS           66215   -330.00            32
KY       402597029   -200.00            22
LA      1406043327   1300.00            74
MA       123026638    -83.00           208
MD       416287617    300.00            55
ME       165647170   2520.00           122
MI      2426973485  -1265.00           164
MN      1102338918    322.00           100
MO           64111    100.00            20
NC           27502    500.00            16
NH        32564424    -24.60            32
NJ        70254993   -817.45            64
NV      3575889763    725.00           144
NY       606129991  -6474.50           233
OH          176071    450.00            80
OK      2202499044    800.00           102
PA       540499020  -2146.00           145
RI        58065892    200.00            70
SC       296214789   2400.00            69
TN           37188    -25.00            32
TX      6221452245   1985.24           302
UT      9251153394   5050.00           340
VA       440691831    515.92           135
WA      2941290251   -500.00            90

In [61]:
dfcwci.groupby("state")['amount'].mean()

state
AK     403.333333
AR    1183.333333
AZ     120.000000
CA    -217.988261
CO   -1455.750000
CT    2300.000000
DC    -309.982000
FL    -135.000000
IA     250.000000
ID    -261.000000
IL    -931.133333
KS    -330.000000
KY    -200.000000
LA     650.000000
MA     -13.833333
MD     150.000000
ME     630.000000
MI    -253.000000
MN     107.333333
MO     100.000000
NC     500.000000
NH     -24.600000
NJ    -408.725000
NV     181.250000
NY    -809.312500
OH     112.500000
OK     266.666667
PA    -429.200000
RI     100.000000
SC     800.000000
TN     -25.000000
TX     220.582222
UT     459.090909
VA     103.184000
WA    -166.666667
Name: amount, dtype: float64

In [62]:
dfcwci.state.unique()

array(['VA', 'CA', 'AR', 'DC', 'SC', 'IA', 'OH', 'NC', 'UT', 'MO', 'IL',
       'ME', 'FL', 'MD', 'MI', 'CO', 'WA', 'NY', 'TX', 'KY', 'PA', 'TN',
       'MA', 'MN', 'KS', 'NJ', 'NH', 'ID', 'OK', nan, 'NV', 'CT', 'RI',
       'AK', 'LA', 'AZ'], dtype=object)

In [64]:
out=make_query("SELECT state, SUM(amount) FROM contributors GROUP BY state;")
make_frame(out, legend=['state', 'sum'])

   state       sum
0   None  -1000.00
1     AK   2420.00
2     AR  28400.00
3     AZ    240.00
4     CA -10027.46
5     CO -11646.00
6     CT   4600.00
7     DC  -3099.82
8     FL  -8100.00
9     IA    500.00
10    ID   -522.00
11    IL -11173.60
12    KS   -660.00
13    KY   -400.00
14    LA   2600.00
15    MA   -166.00
16    MD    600.00
17    ME   5040.00
18    MI  -2530.00
19    MN    644.00
20    MO    200.00
21    NC   1000.00
22    NH    -49.20
23    NJ  -1634.90
24    NV   1450.00
25    NY -12949.00
26    OH    900.00
27    OK   1600.00
28    PA  -4292.00
29    RI    400.00
30    SC   4800.00
31    TN    -50.00
32    TX   3970.48
33    UT  10100.00
34    VA   1031.84
35    WA  -1000.00

In [65]:
dfcwci.head()

  last_name first_name middle_name                street_1 street_2         city state    zip  amount        date  candidate_id
0      Agee     Steven         NaN  549 Laurel Branch Road      NaN        Floyd    VA  24091   500.0  2007-06-30            16
1    Ahrens        Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566   250.0  2007-05-16            16
2    Ahrens        Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566    50.0  2007-06-18            16
3    Ahrens        Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566   100.0  2007-06-21            16
4      Akin    Charles         NaN  10187 Sugar Creek Road      NaN  Bentonville    AR  72712   100.0  2007-06-16            16

In [66]:
df2 = dfcwci.copy()

In [67]:
df2.set_index('last_name', inplace=True)
df2.head()

          first_name middle_name                street_1 street_2         city state    zip  amount        date  candidate_id
last_name
Agee          Steven         NaN  549 Laurel Branch Road      NaN        Floyd    VA  24091   500.0  2007-06-30            16
Ahrens           Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566   250.0  2007-05-16            16
Ahrens           Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566    50.0  2007-06-18            16
Ahrens           Don         NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566   100.0  2007-06-21            16
Akin         Charles         NaN  10187 Sugar Creek Road      NaN  Bentonville    AR  72712   100.0  2007-06-16            16

In [68]:
df2.drop(['Ahrens'], inplace=True)
df2.head()

          first_name middle_name                      street_1 street_2         city state    zip  amount        date  candidate_id
last_name
Agee          Steven         NaN        549 Laurel Branch Road      NaN        Floyd    VA  24091   500.0  2007-06-30            16
Akin         Charles         NaN        10187 Sugar Creek Road      NaN  Bentonville    AR  72712   100.0  2007-06-16            16
Akin            Mike         NaN              181 Baywood Lane      NaN   Monticello    AR  71655  1500.0  2007-05-18            16
Akin         Rebecca         NaN              181 Baywood Lane      NaN   Monticello    AR  71655   500.0  2007-05-18            16
Aldridge     Brittni         NaN  808 Capitol Square Place, SW      NaN   Washington    DC  20024   250.0  2007-06-06            16

In [69]:
df2.reset_index(inplace=True)
df2.head()

  last_name first_name middle_name                      street_1 street_2         city state    zip  amount        date  candidate_id
0      Agee     Steven         NaN        549 Laurel Branch Road      NaN        Floyd    VA  24091   500.0  2007-06-30            16
1      Akin    Charles         NaN        10187 Sugar Creek Road      NaN  Bentonville    AR  72712   100.0  2007-06-16            16
2      Akin       Mike         NaN              181 Baywood Lane      NaN   Monticello    AR  71655  1500.0  2007-05-18            16
3      Akin    Rebecca         NaN              181 Baywood Lane      NaN   Monticello    AR  71655   500.0  2007-05-18            16
4  Aldridge    Brittni         NaN  808 Capitol Square Place, SW      NaN   Washington    DC  20024   250.0  2007-06-06            16

In [70]:
dfcwci=dfcwci[dfcwci.last_name!='Ahrens']
dfcwci.head(10)

   last_name first_name middle_name                      street_1 street_2           city state    zip  amount        date  candidate_id
0       Agee     Steven         NaN        549 Laurel Branch Road      NaN          Floyd    VA  24091   500.0  2007-06-30            16
4       Akin    Charles         NaN        10187 Sugar Creek Road      NaN    Bentonville    AR  72712   100.0  2007-06-16            16
5       Akin       Mike         NaN              181 Baywood Lane      NaN     Monticello    AR  71655  1500.0  2007-05-18            16
6       Akin    Rebecca         NaN              181 Baywood Lane      NaN     Monticello    AR  71655   500.0  2007-05-18            16
7   Aldridge    Brittni         NaN  808 Capitol Square Place, SW      NaN     Washington    DC  20024   250.0  2007-06-06            16
8      Allen    John D.         NaN        1052 Cannon Mill Drive      NaN  North Augusta    SC  29860  1000.0  2007-06-11            16
9      Allen    John D.         NaN        1052 Cannon Mill Drive      NaN  North Augusta    SC  29860  1300.0  2007-06-29            16
10   Allison    John W.         NaN                 P.O. Box 1089      NaN         Conway    AR  72033  1000.0  2007-05-18            16
11   Allison    Rebecca         NaN             3206 Summit Court      NaN    Little Rock    AR  72227  1000.0  2007-04-25            16
12   Allison    Rebecca         NaN             3206 Summit Court      NaN    Little Rock    AR  72227   200.0  2007-06-12            16

In [71]:
drow="DELETE FROM contributors WHERE last_name=\"Ahrens\";"
db.cursor().execute(drow)

In [72]:
db.commit()

In [73]:
out=make_query("SELECT * FROM contributors;")
make_frame(out).head(10)

   id last_name first_name middle_name                      street_1 street_2           city state    zip  amount        date  candidate_id
0   1      Agee     Steven        None        549 Laurel Branch Road     None          Floyd    VA  24091   500.0  2007-06-30            16
1   5      Akin    Charles        None        10187 Sugar Creek Road     None    Bentonville    AR  72712   100.0  2007-06-16            16
2   6      Akin       Mike        None              181 Baywood Lane     None     Monticello    AR  71655  1500.0  2007-05-18            16
3   7      Akin    Rebecca        None              181 Baywood Lane     None     Monticello    AR  71655   500.0  2007-05-18            16
4   8  Aldridge    Brittni        None  808 Capitol Square Place, SW     None     Washington    DC  20024   250.0  2007-06-06            16
5   9     Allen    John D.        None        1052 Cannon Mill Drive     None  North Augusta    SC  29860  1000.0  2007-06-11            16
6  10     Allen    John D.        None        1052 Cannon Mill Drive     None  North Augusta    SC  29860  1300.0  2007-06-29            16
7  11   Allison    John W.        None                 P.O. Box 1089     None         Conway    AR  72033  1000.0  2007-05-18            16
8  12   Allison    Rebecca        None             3206 Summit Court     None    Little Rock    AR  72227  1000.0  2007-04-25            16
9  13   Allison    Rebecca        None             3206 Summit Court     None    Little Rock    AR  72227   200.0  2007-06-12            16

In [74]:
out=make_query("SELECT * FROM contributors LIMIT 3;")
make_frame(out).head(10)

   id last_name first_name middle_name                street_1 street_2         city state    zip  amount        date  candidate_id
0   1      Agee     Steven        None  549 Laurel Branch Road     None        Floyd    VA  24091     500  2007-06-30            16
1   5      Akin    Charles        None  10187 Sugar Creek Road     None  Bentonville    AR  72712     100  2007-06-16            16
2   6      Akin       Mike        None        181 Baywood Lane     None   Monticello    AR  71655    1500  2007-05-18            16

In [20]:
crind="CREATE INDEX amount_ix ON contributors(amount);"
db.cursor().execute(crind)
db.commit()

In [21]:
%%bash
echo ".schema" | sqlite3 cancont.db

CREATE TABLE IF NOT EXISTS "candidates" (
    "id" INTEGER PRIMARY KEY  NOT NULL,
    "first_name" VARCHAR,
    "last_name" VARCHAR,
    "middle_name" VARCHAR,
    "party" VARCHAR NOT NULL
);
CREATE TABLE IF NOT EXISTS "contributors" (
    "id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
    "last_name" VARCHAR,
    "first_name" VARCHAR,
    "middle_name" VARCHAR,
    "street_1" VARCHAR,
    "street_2" VARCHAR,
    "city" VARCHAR,
    "state" VARCHAR,
    "zip" VARCHAR,
    "amount" INTEGER,
    "date" DATETIME,
    "candidate_id" INTEGER NOT NULL,
    FOREIGN KEY(candidate_id) REFERENCES candidates(id)
);
CREATE TABLE sqlite_sequence(name,seq);
CREATE INDEX amount_ix ON contributors(amount);

In [16]:
crind="DROP INDEX amount_ix;"
db.cursor().execute(crind)
db.commit()

In [17]:
%%bash
echo ".schema" | sqlite3 cancont.db

CREATE TABLE IF NOT EXISTS "candidates" (
    "id" INTEGER PRIMARY KEY  NOT NULL,
    "first_name" VARCHAR,
    "last_name" VARCHAR,
    "middle_name" VARCHAR,
    "party" VARCHAR NOT NULL
);
CREATE TABLE IF NOT EXISTS "contributors" (
    "id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
    "last_name" VARCHAR,
    "first_name" VARCHAR,
    "middle_name" VARCHAR,
    "street_1" VARCHAR,
    "street_2" VARCHAR,
    "city" VARCHAR,
    "state" VARCHAR,
    "zip" VARCHAR,
    "amount" INTEGER,
    "date" DATETIME,
    "candidate_id" INTEGER NOT NULL,
    FOREIGN KEY(candidate_id) REFERENCES candidates(id)
);
CREATE TABLE sqlite_sequence(name,seq);

In [15]:
dfcand.head()

   id   first_name  last_name middle_name party
0  33       Joseph      Biden         NaN     D
1  36       Samuel  Brownback         NaN     R
2  34      Hillary    Clinton          R.     D
3  39  Christopher       Dodd          J.     D
4  26         John    Edwards         NaN     D

In [29]:
obamaid = dfcand.query("last_name=='Obama'")['id'].values[0]

In [30]:
obamaid

20

In [31]:
obamacontrib=dfcwci.query("candidate_id==%i" % obamaid)
obamacontrib.head()

   last_name first_name middle_name         street_1 street_2        city state        zip  amount        date  candidate_id
25   Buckler      Steve         NaN  24351 Armada Dr      NaN  Dana Point    CA  926291306    50.0  2007-07-30            20
26   Buckler      Steve         NaN  24351 Armada Dr      NaN  Dana Point    CA  926291306    25.0  2007-08-16            20
27  Buckheit      Bruce         NaN    8904 KAREN DR      NaN     FAIRFAX    VA  220312731   100.0  2007-09-19            20
28    Buckel      Linda         NaN    PO Box 683130      NaN   Park City    UT  840683130  2300.0  2007-08-14            20
29    Buckel      Linda         NaN    PO Box 683130      NaN   Park City    UT  840683130 -2300.0  2007-08-14            20

In [24]:
russiandollsel="""
SELECT * FROM contributors WHERE
    candidate_id = (SELECT id from candidates WHERE last_name='Obama');
"""
out=make_query(russiandollsel)
make_frame(out).head()

   id last_name first_name middle_name         street_1 street_2        city state        zip  amount        date  candidate_id
0  26   Buckler      Steve        None  24351 Armada Dr     None  Dana Point    CA  926291306    50.0  2007-07-30            20
1  27   Buckler      Steve        None  24351 Armada Dr     None  Dana Point    CA  926291306    25.0  2007-08-16            20
2  28  Buckheit      Bruce        None    8904 KAREN DR     None     FAIRFAX    VA  220312731   100.0  2007-09-19            20
3  29    Buckel      Linda        None    PO Box 683130     None   Park City    UT  840683130  2300.0  2007-08-14            20
4  30    Buckel      Linda        None    PO Box 683130     None   Park City    UT  840683130 -2300.0  2007-08-14            20

In [25]:
implicitjoinsel="""
SELECT
    contributors.last_name, contributors.first_name,
    contributors.amount, candidates.last_name
FROM
    contributors, candidates
WHERE
    contributors.candidate_id = candidates.id
AND
    candidates.last_name = 'Obama';
    """
out = make_query(implicitjoinsel)
make_frame(out, legend=["contributors.last_name",
                        "contributors.first_name",
                        "contributors.amount",
                        "candidates.last_name"]).head()

  contributors.last_name contributors.first_name  contributors.amount candidates.last_name
0                Buckler                   Steve                 50.0                Obama
1                Buckler                   Steve                 25.0                Obama
2               Buckheit                   Bruce                100.0                Obama
3                 Buckel                   Linda               2300.0                Obama
4                 Buckel                   Linda              -2300.0                Obama

In [28]:
cols_wanted=['last_name_x', 'first_name_x', 'candidate_id', 'id', 'last_name_y']
dfcwci.merge(dfcand, left_on='candidate_id', right_on='id')[cols_wanted]

    last_name_x first_name_x  candidate_id  id last_name_y
0          Agee       Steven            16  16    Huckabee
1        Ahrens          Don            16  16    Huckabee
2        Ahrens          Don            16  16    Huckabee
3        Ahrens          Don            16  16    Huckabee
4          Akin      Charles            16  16    Huckabee
..          ...          ...           ...  ..         ...
170    ABESHAUS      MERRILL            37  37      McCain
171     ABRAHAM       GEORGE            37  37      McCain
172  ABRAHAMSON        PETER            37  37      McCain
173     ABRAHAM        SALEM            37  37      McCain
174     ABRAHAM        SALEM            37  37      McCain

[175 rows x 5 columns]

In [30]:
explicitjoinsel="""
SELECT 
    contributors.last_name, contributors.first_name, candidates.last_name
FROM
    contributors JOIN candidates
ON contributors.candidate_id = candidates.id
"""
out=make_query(explicitjoinsel)
make_frame(out, legend=["contributors.last_name",
                "contributors.first_name", "candidates.last_name"]).head()

  contributors.last_name contributors.first_name candidates.last_name
0                   Agee                  Steven             Huckabee
1                 Ahrens                     Don             Huckabee
2                 Ahrens                     Don             Huckabee
3                 Ahrens                     Don             Huckabee
4                   Akin                 Charles             Huckabee

In [31]:
explicitjoinsel="""
SELECT
    COUNT(contributors.id), contributors.first_name, candidates.last_name
FROM
    contributors JOIN candidates
ON 
    contributors.candidate_id = candidates.id
GROUP BY
    candidates.last_name;
"""
out=make_query(explicitjoinsel)
make_frame(out, legend=["count(contributors.id)",
                        "contributors.first_name", "candidates.last_name"])

   count(contributors.id) contributors.first_name candidates.last_name
0                      25                 Rebecca              Clinton
1                      25                 HERBERT             Giuliani
2                      25                  Steven             Huckabee
3                      25                  ZAINUL               McCain
4                      25                   Steve                Obama
5                      25                   Bryan                 Paul
6                      25                  TRAVIS               Romney

In [32]:
len(make_query("SELECT DISTINCT id, last_name FROM candidates;"))

17

In [33]:
dfcwci.merge(dfcand, left_on="candidate_id", right_on="id", how="left")[cols_wanted]

    last_name_x first_name_x  candidate_id  id last_name_y
0          Agee       Steven            16  16    Huckabee
1        Ahrens          Don            16  16    Huckabee
2        Ahrens          Don            16  16    Huckabee
3        Ahrens          Don            16  16    Huckabee
4          Akin      Charles            16  16    Huckabee
..          ...          ...           ...  ..         ...
170    ABESHAUS      MERRILL            37  37      McCain
171     ABRAHAM       GEORGE            37  37      McCain
172  ABRAHAMSON        PETER            37  37      McCain
173     ABRAHAM        SALEM            37  37      McCain
174     ABRAHAM        SALEM            37  37      McCain

[175 rows x 5 columns]

In [34]:
dfcwci

      last_name first_name middle_name                street_1 street_2          city state        zip  amount        date  candidate_id
0          Agee     Steven         NaN  549 Laurel Branch Road      NaN         Floyd    VA      24091   500.0  2007-06-30            16
1        Ahrens        Don         NaN    4034 Rennellwood Way      NaN    Pleasanton    CA      94566   250.0  2007-05-16            16
2        Ahrens        Don         NaN    4034 Rennellwood Way      NaN    Pleasanton    CA      94566    50.0  2007-06-18            16
3        Ahrens        Don         NaN    4034 Rennellwood Way      NaN    Pleasanton    CA      94566   100.0  2007-06-21            16
4          Akin    Charles         NaN  10187 Sugar Creek Road      NaN   Bentonville    AR      72712   100.0  2007-06-16            16
..          ...        ...         ...                     ...      ...           ...   ...        ...     ...         ...           ...
170    ABESHAUS    MERRILL          M.  1801 N. HEREFORD DRIVE      NaN     FLAGSTAFF    AZ  860011121   120.0  2008-01-16            37
171     ABRAHAM     GEORGE         NaN           P.O. BOX 1504      NaN  LAKE CHARLES    LA  706021504   800.0  2008-01-17            37
172  ABRAHAMSON      PETER          J.   1030 W. ROSCOE STREET      NaN       CHICAGO    IL  606572207    50.0  2008-01-25            37
173     ABRAHAM      SALEM          A.              P.O. BOX 7      NaN      CANADIAN    TX  790140007  1000.0  2008-01-17            37
174     ABRAHAM      SALEM          A.              P.O. BOX 7      NaN      CANADIAN    TX  790140007  1300.0  2008-01-30            37

[175 rows x 11 columns]

In [45]:
explicitjoinsel="""

SELECT 
    COUNT(contributors.id), contributors.first_name, candidates.last_name,
        contributors.candidate_id, candidates.id
FROM 
    contributors LEFT OUTER JOIN candidates 
ON contributors.candidate_id = candidates.id

GROUP BY candidates.last_name;
"""
out=make_query(explicitjoinsel)
make_frame(out, legend=["count(contributors.id)", "contributors.first_name",
                      "contributors.candidate_id", "candidates.id", "candidates.last_name"])

   count(contributors.id) contributors.first_name contributors.candidate_id  candidates.id  candidates.last_name
0                      25                 Rebecca                   Clinton             34                    34
1                      25                 HERBERT                  Giuliani             22                    22
2                      25                  Steven                  Huckabee             16                    16
3                      25                  ZAINUL                    McCain             37                    37
4                      25                   Steve                     Obama             20                    20
5                      25                   Bryan                      Paul             32                    32
6                      25                  TRAVIS                    Romney             35                    35

In [46]:
dfcwci.merge(dfcand, left_on="candidate_id", right_on="id", how='right')

    last_name_x first_name_x middle_name_x                street_1 street_2         city state      zip  amount        date  candidate_id  id first_name_y last_name_y middle_name_y party
0          Agee       Steven           NaN  549 Laurel Branch Road      NaN        Floyd    VA  24091.0   500.0  2007-06-30          16.0  16         Mike    Huckabee           NaN     R
1        Ahrens          Don           NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566.0   250.0  2007-05-16          16.0  16         Mike    Huckabee           NaN     R
2        Ahrens          Don           NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566.0    50.0  2007-06-18          16.0  16         Mike    Huckabee           NaN     R
3        Ahrens          Don           NaN    4034 Rennellwood Way      NaN   Pleasanton    CA  94566.0   100.0  2007-06-21          16.0  16         Mike    Huckabee           NaN     R
4          Akin      Charles           NaN  10187 Sugar Creek Road      NaN  Bentonville    AR  72712.0   100.0  2007-06-16          16.0  16         Mike    Huckabee           NaN     R
..          ...          ...           ...                     ...      ...          ...   ...      ...     ...         ...           ...  ..          ...         ...           ...   ...
180         NaN          NaN           NaN                     NaN      NaN          NaN   NaN      NaN     NaN         NaN           NaN  30       Duncan      Hunter           NaN     R
181         NaN          NaN           NaN                     NaN      NaN          NaN   NaN      NaN     NaN         NaN           NaN  31       Dennis    Kucinich           NaN     D
182         NaN          NaN           NaN                     NaN      NaN          NaN   NaN      NaN     NaN         NaN           NaN  29         Bill  Richardson           NaN     D
183         NaN          NaN           NaN                     NaN      NaN          NaN   NaN      NaN     NaN         NaN           NaN  38          Tom    Tancredo           NaN     R
184         NaN          NaN           NaN                     NaN      NaN          NaN   NaN      NaN     NaN         NaN           NaN  41         Fred    Thompson            D.     R

[185 rows x 16 columns]

In [47]:
dfcwci.merge(dfcand, left_on = "candidate_id", right_on="id", how="outer")[cols_wanted]

    last_name_x first_name_x  candidate_id  id last_name_y
0          Agee       Steven          16.0  16    Huckabee
1        Ahrens          Don          16.0  16    Huckabee
2        Ahrens          Don          16.0  16    Huckabee
3        Ahrens          Don          16.0  16    Huckabee
4          Akin      Charles          16.0  16    Huckabee
..          ...          ...           ...  ..         ...
180         NaN          NaN           NaN  30      Hunter
181         NaN          NaN           NaN  31    Kucinich
182         NaN          NaN           NaN  29  Richardson
183         NaN          NaN           NaN  38    Tancredo
184         NaN          NaN           NaN  41    Thompson

[185 rows x 5 columns]

In [48]:
pd.read_sql("SELECT * FROM candidates WHERE party = 'D';", db)

   id   first_name   last_name middle_name party
0  20       Barack       Obama        None     D
1  24         Mike      Gravel        None     D
2  26         John     Edwards        None     D
3  29         Bill  Richardson        None     D
4  31       Dennis    Kucinich        None     D
5  33       Joseph       Biden        None     D
6  34      Hillary     Clinton          R.     D
7  39  Christopher        Dodd          J.     D

In [49]:
pd.read_sql(implicitjoinsel, db)

   last_name first_name   amount last_name
0    Buckler      Steve    50.00     Obama
1    Buckler      Steve    25.00     Obama
2   Buckheit      Bruce   100.00     Obama
3     Buckel      Linda  2300.00     Obama
4     Buckel      Linda -2300.00     Obama
5     Buckel      Linda  4600.00     Obama
6       Buck     Thomas   100.00     Obama
7       Buck        Jay   200.00     Obama
8       Buck     Blaine  2300.00     Obama
9       Buck    Barbara    50.00     Obama
10      Buck    Barbara    50.00     Obama
11   Buchman     Mark M   460.80     Obama
12    Bucher        Ida   100.00     Obama
13  Buchanek  Elizabeth    50.00     Obama
14  Buchanan       John   500.00     Obama
15  Buchanan       John  -500.00     Obama
16  Buchanan       John   500.00     Obama
17  Buchanan       John   700.00     Obama
18  Buchanan       John  -700.00     Obama
19  Buchanan       John  1000.00     Obama
20  Buchanan       John  1300.00     Obama
21  Buchanan       John   200.00     Obama
22  Buchanan       John   500.00     Obama
23  Buchanan       John   200.09     Obama
24  Harrison       Ryan    25.00     Obama

In [50]:
db.close()